[
  {
    "path": "posts/2021-02-10-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Tay Kai Lin",
        "url": "https://www.linkedin.com/in/kai-lin-tay/"
      }
    ],
    "date": "2021-02-10",
    "categories": [],
    "contents": "\r\nOriginal Data Visualization\r\nThe original visualizations display data originating from a study under Imperial College London YouGov Covid-19 Behavior Tracker Data Hub conducted to understand the willingness of the public to undergo Covid-19 vaccination around the world. Data can be extracted from Github at the following link. A screenshot of the two data visualization produced by one of the research scientists is provided below:\r\n\r\nFigure 1: Original Data Visualization\r\nPart A: Critic of the graph for its clarity and aesthetics\r\nThe graph is beautiful but confusing.\r\nThe graph is beautiful due to the following reasons:\r\nAppropriate choice of colors: In the legend, vibrant colors are chosenw hich are attractive to the reader. The colors are well chosen and are sufficiently contrasting. In addition, there is consistency across both graphs, where the same color was used to represent the proportion that strongly agreed to vaccination.\r\nGraph is sorted: The graph on the right is sorted in descending order. This arrangement is aesthetic and pleasing to the eyes.\r\nAppropriate use of spacing: The space taken up by both graphs is consistent. Both graphs have the same height, and the same width. Despite having different scales on the x-axis, the preparer of the graph adjusted the widths of both graphs such that the length of the first row of the right graph (United Kingdom) is approximately equal to the width of the rows in the left graph. Consistency in the usage of spacing is aesthetic to the reader.\r\nHowever, the graph is confusing due to the following reasons:\r\nColor scale can be better chosen to reflect ordinal data type: Color scale can be more efficiently used. The x-axis in this question is ordinal where participants of the study can rate their agreement to vaccination from 1 to 5. The ordinal type of the variable can be reflected in the color scale, where both ends of the scale can showcase increasing intensity (from 2 to 1 and from 4 to 5).\r\nVisualize uncertainty of sampling: The graph on the right (% of strongly agreed to vaccination) does not visualize the uncertainty in sampling. Smaller sample sizes have greater errors as surveyors can claim with less certainty that the sample results would be applicable to the population. In visualizing the percentage of survey respondents who strongly agree to receiving the vaccine, we have to visualize the uncertainty involved in sampling to apply the sample results to the population at large.\r\nUnclear title of graph: The title of the graph on the left is unclear. The title is a question ‘Which country is more pro-vaccine?’ and the respondent answer should be the name of a country. However, the graph depicts survey responses that range from ‘Strongly Agree’ to ‘Strongly Disagree’, and the reader of the graph is unable to decipher what the survey respondents are agreeing or disagreeing towards.\r\nPoor comparability across both graphs: In both graphs, the countries are not listed in the same order. The graph on the left has its countries sorted by alphabetical order whereas the graph on the right has its countries sorted by descending order according to the percentage that strongly agreed to the vaccination. To compare a country across both graphs, taking the United Kingdom as an example, the reader would need to look at the most bottom row of the left graph and compare it with the top row of the right graph. It would be much easier to do the comparison if they were in the same row.\r\nPart B: Suggesting an improved alternative graphical presentation\r\nWith reference to the critics above, the following suggestions have been proposed.\r\nColor scale can be better chosen to reflect ordinal data type: Instead of using 5 separate colors, a color scale will be used from red to yellow to green which will represent the survey responses ‘disagree’, ‘neutral’ and ‘agree’ respectively.\r\nVisualize uncertainty of sampling: To visualize uncertainty, standard error will be computed based on every country’s sample size and added to the graph.\r\nUnclear title of graph: For greater clarity, the exact survey question will be stated in the visualization so that the user is able to know exactly what survey respondents are agreeing or disagreeing with.\r\nPoor comparability across both graphs: Both graphs will be sorted in the same order of countries.\r\nThe proposed alternative data visualization is as follows:\r\n\r\nFigure 2: Sketch of Proposed Visualization\r\nThe proposed visualization will contain two graphs. The graph of the left depicts the distribution of all 5 survey responses on the Likert scale. THe graph on the right depicts the proportion of ‘Strongly Agree’ responses and the standard error involved in sampling. The bottom section of the visualization contains the legend of the Likert scale and filters that the user can interact with to see how the parameters ‘Gender’ and ’ Employment Status’ affect both visualizations.\r\nPart C: Designing the proposed data visualization using Tableau\r\nThe visualization is available in the following here.\r\nPart D: Description of Data Visualization Preparation\r\n1. Data Extraction from Github\r\nIn Github, the datasets are found in the folder ‘Data’ and are listed by countries. For this visualization, we will only be using the 14 countries that are found in the original visualization. Each country’s dataset is downloaded individually. The text files are downloaded as csv files by adding .csv to their file names.\r\nThe metadata is also downloaded to help in my understanding of the columns in the dataset.\r\n\r\nFigure 3: Screenshot of Github\r\n2. Data Preparation\r\nEvery country’s file contains many columns, many of which are not relevant for this analysis. Thus, only the relevant columns are extracted and saved in a separate csv file. The columns are: * gender * employment_status * vac_1 * vac2_1 * vac2_2 * vac2_3 * vac2_6\r\nThe columns for ‘gender’ and ‘employment_status’ will be used as filters to breakdown the survey results by this parameters for further insights into how these parameters affect survey responses. While vac_1 was the survey question used in the original visualization, this visualization will also look at the other statements to give a more holistic understanding on the attitudes that survey respondents have towards Covid-19 and the vaccination.\r\nA screenshot of the extracted columns for every country is as follows:\r\n\r\nFigure 4: Screenshot of Github\r\nWhile column extraction is relatively straightforward for most countries, some countries required data manipulation for the column, ‘employment_status’, where it was stored in binary columns instead of a single column, such as follows:\r\n\r\nFigure 5: employment_status stored as binary columns\r\nTo convert the data into the required form, two columns need to be created. In the first column I used Index and Match in Excel to return the column title corresponding to the value ‘Yes’ for every row. In the second column, based on the rightmost character of the column title (i.e. the number in the legend), I used a lookup table to convert the symbolic numbers into the respective employment status. Both created columns are shown below:\r\n\r\nFigure 6: Two created columns that are used to convert binary columns of employment_status into a single column\r\nThe data file of every country is stored into the same folder for ease of import into Tableau in the upcoming step.\r\n3. Importing data into Tableau\r\nTo import the data into Tableau, I created a connection with any of the text files in the folder. This is done through the left pane of Tableau, under Connect > To a File > Text File.\r\nAfter creating the connection, I removed the text file from the main pane by clicking on the down arrow next to the csv file name > Remove. Then, I create a union by double-clicking on New Union in the left pane. In the pop-up, I drag and drop all the csv files from the left pane (as seen in the figure below), and click apply.\r\n\r\nFigure 7: Creating a union of the separate csv files in Tableau\r\n3.1 Renaming Columns and Creating Aliases\r\nColumns should be renamed for greater clarity, and aliases should be created for values where appropriate. The following steps were taken: * As all the survey question columns are stated in codes, I renamed them to their corresponding survey questions based on the metadata. * ‘Table Name’ is renamed as ‘Country’ to better describe the column values * Values in the column for ‘Country’ are renamed to remove the ‘.csv’ suffix * For aesthetics, ‘age’ and ‘household’ are capitalized.\r\n4. Preparing Bar Chart\r\n4.1 Creating Calculated Fields and Parameters\r\nCreate a new worksheet and rename it as ‘Bar Chart’. The first step would be to create the necessary calculated fields and parameters. A parameter is created by clicking on the black down arrow at the top of the data pane > create parameter. A field is created by clicking on the same black down arrow > create calculated field.\r\nCreate a parameter for Survey Question: A parameter needs to be created for survey question to allow users of the dashboard to select the survey question that they are interested in and observe how the responses change. Name the parameter as Survey Question, set the data type as String and change the allowable value to List. Under List, add all the survey questions as values. A screenshot of the Parameter is as follows:\r\n\r\nFigure 8: Creating a parameter for Survey Question\r\nCreate a calculated field for Number of Records: An indicator of 1 is used for every row for subsequent computations.\r\n\r\nFigure 9: Creating a calculated field for Number of Records\r\nCreate a calculated field for Total Count: This field helps to find the total count of all the records, and it will be used as the denominator of the Percentage in the following calculation.\r\n\r\nFigure 10: Creating a calculated field for Total Count\r\nCreate a calculated field for Percentage: Percentage would be used to indicate the proportions of each survey response out of the total count of survey responses for the country.\r\n\r\nFigure 11: Creating a calculated field for Percentage\r\nCreate a calculated field for Selector: Selector would be used to indicate to Tableau under the Color marker what survey question column it should refer to. This field would be tied to the Parameter field so that the visualization would change according to what the user inputs.\r\n\r\nFigure 12: Creating a calculated field for Selector\r\n4.2 Adding elements to the visualization\r\nAfter the fields and parameter are created, the basic visualization can be created. ‘Percentage’ can be dragged to Columns and ‘Country’ can be dragged to Rows. Drag ‘Selector’ onto Color under Marks.\r\nSubsequently, the interactive elements (i.e. filters and parameter) can be added. Click on the down arrow on ‘Survey Question’ and select Show Parameter. Drag and drop ‘Gender’ and ‘Employment Status’ to the filter. Click on the down arrow on both items under the filter and select show filter.\r\n4.3 Formatting the aesthetics of the visualization\r\nThe final step would be to format the aesthetics of the visualization. The first element would be the colors of the legend. As previously mentioned, a scale from red to green will be used. To format the colors, click on the down arrow on the top right of the legend > edit colors. I selected the Color Palette Tableau 20, and chose red, orange, yellow, light green and dark green to represent 1 to 5 respectively. A screenshot of the legend is below:\r\n\r\nFigure 13: Creating a red-green color scale for the legend\r\nThe next step in aesthetics is to format the axis as a percentage. Right click on the x axis > format. Under scale > numbers, change the settings from Automatic to Percentage and change the nmber of decimal places from 2 to 1. As the axis is also self-explanatory as a percentage, it does not need to be labelled as ‘Percentage’. To remove the label, right click on the x axis > edit axis. In the field for axis titles, delete all characters and leave it as blank.\r\nThe final step in aesthetics is to format the rows so that they would be sorted in the same order as the right visualization for ease of comparability. Select the down arrow on the Country label in Rows > Sort. Under Sort By, select Field. Under Sort Order, select Descending. Under Field Name, select Prop (a calculated field that would is created under Uncertainty Graph). Aggregation would be automatically selected as Custom. A screenshot of the settings is below:\r\n\r\nFigure 14: Formatting the rows so that they would be sorted in the same order as the Uncertainty Graph\r\n5. Preparing Uncertainty Graph\r\n5.1 Creating Calculated Fields and Parameters\r\nCreate a new worksheet and rename it as ‘Uncertainty Chart’. The first step would be to create the necessary calculated fields and parameters.\r\nCreating a calculated field for % strongly agree: As this visualization only focuses on the percentage of survey respondents that strongly agree, I needed to extract this proportion only. For this field to be interactive such that when the Survey Question is toggled to a particular question, values in that column would appear, if-else statements are required. When a survey question is selected, then responses that are ‘1 - Strongly agree’ in a particular column would be denoted as 1, else all other values are denoted as 0. A screenshot of the formula is below.\r\n\r\nFigure 15: Creating a calculated field for % strongly agree\r\nCreating a calculated field for Prop: Based on the numbers that strongly agree in the previous field, a proportion can be generated based on the sum of the number of records.\r\n\r\nFigure 16: Creating a calculated field for Prop\r\nCreating a calculated field for Prop_SE: For this visualization, the confidence interval is computed at 95%. To find the standard error, the proportion is multipled by 1 - proportion. This number is divided by the sum of the number of records, which is the sample size. Finally, this number would be square rooted.\r\n\r\n\r\nCreating a calculated field for Z_95%: At a 95% confidence interval, Z = 1.959964 or approximately equals to 1.96. This number is input as a field.\r\n\r\n\r\nCreating a calculated field for Prop_Margin of Error: The margin of error is the Z value multiplied by the standard error.\r\n\r\n\r\nCreating a calculated field for Prop_Upper Limit 95%: The upper limit would be the proportion plus the margin of error.\r\n\r\nFigure 20: Creating a calculated field for Prop_Upper Limit 95%\r\nCreating a calculated field for Prop_Lower Limit 95%: The lower limit would be the proportion minus the margin of error.\r\n\r\nFigure 21: Creating a calculated field for Prop_Lower Limit 95%\r\n5.2 Adding elements to the visualization\r\nProportion is added to Columns and Country is added to Rows. Marks is changed from Automatic to Circle. Measure Values is added to columns. Under the Measure Values pane, remove all items except for AGG(Prop_Lower Limit 95%) and AGG(Prop_Upper Limit 95%). Under Measure Values, change the Marks from Automatic to Line. In the Measure Values Marks pane, drag and drop Measure Values to Path and remove it from Color.\r\nClick on the down arrow on Measure Values and select dual axis. To synchronize the dual axis, we need to synchronize the axis that has a smaller range of values to the one with a longer range of values. In this case, the bottom x axis has the shorter range of values. Right click on the bottom x axis and select Synchronize Axis.\r\nSimilar to the steps recounted under Bar Chart, the filters and paramters are added to the visualization.\r\n5.3 Formatting the aesthetics of the visualization\r\nTo ensure that the legend is consistent, the Circle marks representing ‘1 - Strongly agree’ need to be colored the same as that in Bar Chart. Click on the down arrow on Measure Names on the right pane > Edit colors, and select the same shade of green as previously chosen. The color of the line can also be adjusted under Marks > Measure Values > Color. I used a dark grey color to contrast against the white background of the graph, which enhances readability.\r\nFurther formatting measures are similar to those in Bar Chart - formatting of the x-axis to 1 decimal place, sorting the graph in descending order.\r\n6. Preparing Dashboard 6.1 Adding elements to dashboard To create a dashboard, click on the tab ’New Dashboard. In the left pane, adjust the Size to Automatic. Drag and drop both sheets onto the main pane side-by-side.\r\nFor the interactivity of the visualization, when toggling the filters and Survey Question, both visualizations should adjust. To link the filter / parameter to both visualizations, click on the panel > down arrow for more options > apply to worksheets > all using this data source. For the filters, we can allow multiple values in a dropdown. Thus, under down arrow for more options, select Multiple Values (Dropdown).\r\n6.2 Formatting aesthetics of dashboard\r\nFor aesthetics, a title is added with a short description on how the user can navigate the visualization. As both graphs should take up about the same width and height, a blank is inserted above the graph on the left so that both visualizations can be aligned.\r\nPart E: Major Observations from Visualization\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T11:22:10+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Tay Kai Lin",
        "url": "https://www.linkedin.com/in/kai-lin-tay/"
      }
    ],
    "date": "2021-02-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-01T15:26:16+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-01-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover seeks to analyze a graph and provide an improved visualization of it. In the first DataViz Makeover, I will be looking at a graph of resident labor force by age provided in the Report on Labor Force in Singapore 2009 by the Ministry of Manpower.",
    "author": [
      {
        "name": "Tay Kai Lin",
        "url": "https://www.linkedin.com/in/kai-lin-tay/"
      }
    ],
    "date": "2021-02-01",
    "categories": [],
    "contents": "\r\nOriginal Data Visualization\r\nThe original data visualization is of Resident Labor Force by Age in Per Cent, and can be found here. A screenshot of the data visualization is also provided below:\r\n\r\nFigure 1: Original Data Visualization\r\nPart A: Critic of the graph for its clarity and aesthetics\r\nThe graph is beautiful but confusing.\r\nThe graph is beautiful due to the following reasons:\r\nGood and consistent color choice: The color choices of blue and grey was pleasant on the eyes and very readable. The choice of both colors was sufficiently contrasting for readers to separate the two visually, but also highly complementary as a color scheme. In addition, there was also consistency between the line graph, labels at the bottom of the graph and reference lines, where grey was always used to denote 2009 numbers and blue was always used to denote 2019 numbers.\r\nAll elements are well-aligned and spaced: Elements on the graph, namely the line graphs and annotations, were well-placed for readability. Annotations were placed below the line graph and suitably spaced out so as not to interfere with the line graphs, and so that elements are evenly spread throughout the graph and not concentrated at any part of the graph.\r\nGood choice of dotted reference line contrasts with solid graph line: The reference lines used to represent the median age are dotted, which provides a good contrast against the solid graph lines.\r\nHowever, the graph is confusing due to the following reasons:\r\nMissing Y-axis: The graph lacks a y-axis which makes it difficult for the reader to interpret the values at points along the line graph. The points can only be interpreted by referring to the values at the bottom of the graph, resulting in poor readability.\r\nGraph does not explain the write-up: The write-up points out key information that were failed to be highlighted in the graph. For example, the write-up mentions about the share of residents aged 55 and over increasing substantially from 2009 to 2019. However, the graph does not highlight this trend as it does not group residents aged 55 and over in one category\r\nPoor choice of graph type: A line graph is suitable in showing a continuous trend. However, as age groups is a categorical data type, each age group is a distinct class on its own it is not useful to interpret a continuous trend across the age groups. As evident in the write-up, there is no reference to trends across age groups within a year. Instead, insights that were generated related to differences across both years in any age-group. Therefore, using a line graph will draw the reader to interpret trends across age-groups, which is not a useful interpretation.\r\nInappropriate use of reference line: While the intent of the reference line to put an indicator for the median age is clear, the use of a reference along the x axis is inaccurate. While each interval represents an age group, the axis cannot be assumed to have a continuous scale within each interval as the line graph does not have the granularity of data of resident labor force for every year.\r\nPart B: Suggesting an improved alternative graphical presentation\r\nWith reference to the critics above, the following suggestions have been proposed.\r\nAdding a Y-axis: To correct the issue of a missing y-axis, we will input a y-axis.\r\nGraphs to explain the write-up: Besides showing the graph for all the age-groups, I will include graphs that will illustrate what was written in the write-up i.e. showing the change in share of labor force for age groups 25 to 54 and 55 & over, as well as showing the change in median age. The graph for all the age-groups is retained to give readers a full understanding of resident labor force by age.\r\nBar chart: As there is no need for the reader to interpret trends across age-groups, using a bar chart is more appropriate as it highlights that each age-group is distinct on its own.\r\nDepicting the change in median age in a separate graph: I will illustrate the change in median age in a separate graph.\r\nThe proposed alternative data visualization is as follows:\r\n\r\nFigure 2: Sketch of Proposed Visualization\r\nThe proposed visualization will contain 3 graphs. The first graph (top left) depicts the change in resident labor force from 2009 to 2019 for two age groups, which are ages 25-59 and 55 & over. The second graph (top right) depicts the change in median age of the resident labor force. Finally, the bottom graph depicts the change in resident labor force from 2009 to 2019 for all age groups.\r\nPart C: Designing the proposed data visualization using Tableau\r\nThe visualization is available in the following here.\r\nPart D: Description of Data Visualization Preparation\r\nThis is the step-by-step description on the data vizualiation preparation.\r\n1. Data Preparation\r\nThe first step involves extracting the relevant data to produce the visualization. From the report, Table 2 and Table 7 are relevant for data on the median age and resident labor force, respectively. From Table 7, I extracted the columns for 2009 and 2019 into an excel sheet. I then computed the resident labor force percentage by computing the number for each age group over the total provided. I also aggregated the population numbers for ages 25 to 54 as well as 55 & over and computed the respective resident labor force percentage. The resultant table is as follows:\r\n\r\nFigure 3: Resident labour force numbers extracted from Table 7 and saved in Tab ‘Table 7’ of the Excel\r\nMedian age of the resident labor force is extracted from Table 2 as follows, without any need for further computation:\r\n\r\nFigure 4: Median age of resident labour force numbers extracted from Table 2 and saved in Tab ‘Table 2’ of the Excel\r\n2. Importing data into Tableau\r\nThe excel sheet is imported into Tableau. Table 7 and Table 2 are imported as a union into the data source. The resultant table is as follows below. Columns have been renamed for clarity.\r\n\r\nFigure 5: Datasource in Tableau\r\n3. Creating Worksheets\r\n3.1 Resident Labor Force for all age groups\r\nTo create the graph, I need to filter out the rows that are irrelevant. This is done by adding Age (Years) as a filter to only select the 12 required age groups.\r\n\r\nFigure 6: Filtering out the 12 age groups\r\nTo set up the graph, I filled in the columns and rows. Under Show Me, I selected side-by-side bars. The resultant graph is as follows:\r\n\r\nFigure 7: Intermediate graph of the Resident Labour Force for all age groups\r\nFrom the intermediate graph, the following steps were taken to improve on the design of the graph:\r\nRemoving the x-axis labels: The x-axis labels are wordy and will be very squeezed if the words are aligned horizontally. As the legend already clearly depicts what each color represents, I removed the headers on the x-axis.\r\nAdding mark labels: Mark labels will help to identify the height of each graph. Labels are added by selecting ‘Show mark labels’ under Label. The font size is reduced to 8. To format the number as a percentage, I edited the settings under Formatting of the Pane, and changed the number format to percentage. I also reduced the decimal places to 1 and changed the alignment of the text to horizontal.\r\nFormatting the y-axis: I change the format of the scale to percentage. In addition, I renamed the y-axis as Resident Labor Force by editing the y-axis.\r\nThe resultant graph is as follows:\r\n\r\nFigure 8: Final graph for Resident Labour Force of All Age Groups\r\n3.2 Resident Labor Force for ages 25 to 54 and 55 & over\r\nThe steps to create this graph is like that described for all age groups. However, for this graph, the filtering of age groups is for the 2 required age groups, as seen below.\r\n\r\nFigure 9: Filtering of age groups for ages 25 to 54 and 55 & over\r\nLike the previous graph, I added mark labels (but in this case, to 1 decimal place only) and formatted the y-axis. For the x-axis, I edited the alias of the headings. The resultant graph is as follows:\r\n\r\nFigure 10: Final graph of the Resident Labour Force (by per cent) for ages 25 to 54 and 55 & over\r\n3.3 Resident Labor Force Median Age\r\nAs Tableau includes the header as a row, I must filter out the median age.\r\n\r\nFigure 11: Filtering out the median age\r\nFilling up the column and rows, and formatting the title, axis labels and mark labels, I derived the following graph:\r\n\r\nFigure 12: Final graph of the Median Age of Labour Force\r\n4. Combining Worksheets in a Dashboard\r\nTo display all graphs in a single sheet, the dashboard is utilized. The graph of the resident labor force of all age groups is the widest for all the mark labels to be displayed clearly with less overlap. Hence, it is in a row of its own. A title is also added as a descriptor for the graphs. I ensured that the axes for both graphs were of the same scale for easy comparison between both graphs.\r\nPart E: Major Observations from Visualization\r\nFor age groups intervals of 5 from 20 to 54, resident labor force decreased from 2009 to 2019. However, for age groups of 5 from 55 onwards to 70 & over, resident labor force increased from 2009 to 2019. This reflects two very distinct trends in the resident labor force for all age groups where all age groups fall into either category, with the exception of age group 15-19 where resident labor force remained constant.\r\nThe mode age group interval (i.e. age group with the highest occurrences) is 35-39 for 2009 and 45-49 for 2019. For 2009, the mode age group is lower than the median age whereas for 2019, the mode age group is higher than the median age. This could suggest that the 2009 distribution is right-skewed whereas the 2019 distribution is left-skewed.\r\nDistribution of resident labor force in 2019 is much more even than in 2009. In 2009, the top 3 age groups with the highest share of resident labor force exceed 13% whereas in 2019, none of the age groups’ share of resident labor force exceed 13%. In 2009, the lowest 3 age groups are below 2% whereas in 2019, only the lowest age group falls below 2%.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-02T09:39:50+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
