[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Tay Kai Lin",
        "url": "https://www.linkedin.com/in/kai-lin-tay/"
      }
    ],
    "date": "2021-02-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-01T15:26:16+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-01-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover seeks to analyze a graph and provide an improved visualization of it. In the first DataViz Makeover, I will be looking at a graph of resident labor force by age provided in the Report on Labor Force in Singapore 2009 by the Ministry of Manpower.",
    "author": [
      {
        "name": "Tay Kai Lin",
        "url": "https://www.linkedin.com/in/kai-lin-tay/"
      }
    ],
    "date": "2021-02-01",
    "categories": [],
    "contents": "\r\nOriginal Data Visualization\r\nThe original data visualization is of Resident Labor Force by Age in Per Cent, and can be found here. A screenshot of the data visualization is also provided below:\r\n\r\nFigure 1: Original Data Visualization\r\nPart A: Critic of the graph for its clarity and aesthetics\r\nThe graph is beautiful but confusing.\r\nThe graph is beautiful due to the following reasons:\r\nGood and consistent color choice: The color choices of blue and grey was pleasant on the eyes and very readable. The choice of both colors was sufficiently contrasting for readers to separate the two visually, but also highly complementary as a color scheme. In addition, there was also consistency between the line graph, labels at the bottom of the graph and reference lines, where grey was always used to denote 2009 numbers and blue was always used to denote 2019 numbers.\r\nAll elements are well-aligned and spaced: Elements on the graph, namely the line graphs and annotations, were well-placed for readability. Annotations were placed below the line graph and suitably spaced out so as not to interfere with the line graphs, and so that elements are evenly spread throughout the graph and not concentrated at any part of the graph.\r\nGood choice of dotted reference line contrasts with solid graph line: The reference lines used to represent the median age are dotted, which provides a good contrast against the solid graph lines.\r\nHowever, the graph is confusing due to the following reasons:\r\nMissing Y-axis: The graph lacks a y-axis which makes it difficult for the reader to interpret the values at points along the line graph. The points can only be interpreted by referring to the values at the bottom of the graph, resulting in poor readability.\r\nGraph does not explain the write-up: The write-up points out key information that were failed to be highlighted in the graph. For example, the write-up mentions about the share of residents aged 55 and over increasing substantially from 2009 to 2019. However, the graph does not highlight this trend as it does not group residents aged 55 and over in one category\r\nPoor choice of graph type: A line graph is suitable in showing a continuous trend. However, as age groups is a categorical data type, each age group is a distinct class on its own it is not useful to interpret a continuous trend across the age groups. As evident in the write-up, there is no reference to trends across age groups within a year. Instead, insights that were generated related to differences across both years in any age-group. Therefore, using a line graph will draw the reader to interpret trends across age-groups, which is not a useful interpretation.\r\nInappropriate use of reference line: While the intent of the reference line to put an indicator for the median age is clear, the use of a reference along the x axis is inaccurate. While each interval represents an age group, the axis cannot be assumed to have a continuous scale within each interval as the line graph does not have the granularity of data of resident labor force for every year.\r\nPart B: Suggesting an improved alternative graphical presentation\r\nWith reference to the critics above, the following suggestions have been proposed.\r\nAdding a Y-axis: To correct the issue of a missing y-axis, we will input a y-axis.\r\nGraphs to explain the write-up: Besides showing the graph for all the age-groups, I will include graphs that will illustrate what was written in the write-up i.e. showing the change in share of labor force for age groups 25 to 54 and 55 & over, as well as showing the change in median age. The graph for all the age-groups is retained to give readers a full understanding of resident labor force by age.\r\nBar chart: As there is no need for the reader to interpret trends across age-groups, using a bar chart is more appropriate as it highlights that each age-group is distinct on its own.\r\nDepicting the change in median age in a separate graph: I will illustrate the change in median age in a separate graph.\r\nThe proposed alternative data visualization is as follows:\r\n\r\nFigure 2: Sketch of Proposed Visualization\r\nThe proposed visualization will contain 3 graphs. The first graph (top left) depicts the change in resident labor force from 2009 to 2019 for two age groups, which are ages 25-59 and 55 & over. The second graph (top right) depicts the change in median age of the resident labor force. Finally, the bottom graph depicts the change in resident labor force from 2009 to 2019 for all age groups.\r\nPart C: Designing the proposed data visualization using Tableau\r\nThe visualization is available in the following here.\r\nPart D: Description of Data Visualization Preparation\r\nThis is the step-by-step description on the data vizualiation preparation.\r\n1. Data Preparation\r\nThe first step involves extracting the relevant data to produce the visualization. From the report, Table 2 and Table 7 are relevant for data on the median age and resident labor force, respectively. From Table 7, I extracted the columns for 2009 and 2019 into an excel sheet. I then computed the resident labor force percentage by computing the number for each age group over the total provided. I also aggregated the population numbers for ages 25 to 54 as well as 55 & over and computed the respective resident labor force percentage. The resultant table is as follows:\r\n\r\nFigure 3: Resident labour force numbers extracted from Table 7 and saved in Tab ‘Table 7’ of the Excel\r\nMedian age of the resident labor force is extracted from Table 2 as follows, without any need for further computation:\r\n\r\nFigure 4: Median age of resident labour force numbers extracted from Table 2 and saved in Tab ‘Table 2’ of the Excel\r\n2. Importing data into Tableau\r\nThe excel sheet is imported into Tableau. Table 7 and Table 2 are imported as a union into the data source. The resultant table is as follows below. Columns have been renamed for clarity.\r\n\r\nFigure 5: Datasource in Tableau\r\n3. Creating Worksheets\r\n3.1 Resident Labor Force for all age groups\r\nTo create the graph, I need to filter out the rows that are irrelevant. This is done by adding Age (Years) as a filter to only select the 12 required age groups.\r\n\r\nFigure 6: Filtering out the 12 age groups\r\nTo set up the graph, I filled in the columns and rows. Under Show Me, I selected side-by-side bars. The resultant graph is as follows:\r\n\r\nFigure 7: Intermediate graph of the Resident Labour Force for all age groups\r\nFrom the intermediate graph, the following steps were taken to improve on the design of the graph:\r\nRemoving the x-axis labels: The x-axis labels are wordy and will be very squeezed if the words are aligned horizontally. As the legend already clearly depicts what each color represents, I removed the headers on the x-axis.\r\nAdding mark labels: Mark labels will help to identify the height of each graph. Labels are added by selecting ‘Show mark labels’ under Label. The font size is reduced to 8. To format the number as a percentage, I edited the settings under Formatting of the Pane, and changed the number format to percentage. I also reduced the decimal places to 1 and changed the alignment of the text to horizontal.\r\nFormatting the y-axis: I change the format of the scale to percentage. In addition, I renamed the y-axis as Resident Labor Force by editing the y-axis.\r\nThe resultant graph is as follows:\r\n\r\nFigure 8: Final graph for Resident Labour Force of All Age Groups\r\n3.2 Resident Labor Force for ages 25 to 54 and 55 & over\r\nThe steps to create this graph is like that described for all age groups. However, for this graph, the filtering of age groups is for the 2 required age groups, as seen below.\r\n\r\nFigure 9: Filtering of age groups for ages 25 to 54 and 55 & over\r\nLike the previous graph, I added mark labels (but in this case, to 1 decimal place only) and formatted the y-axis. For the x-axis, I edited the alias of the headings. The resultant graph is as follows:\r\n\r\nFigure 10: Final graph of the Resident Labour Force (by per cent) for ages 25 to 54 and 55 & over\r\n3.3 Resident Labor Force Median Age\r\nAs Tableau includes the header as a row, I must filter out the median age.\r\n\r\nFigure 11: Filtering out the median age\r\nFilling up the column and rows, and formatting the title, axis labels and mark labels, I derived the following graph:\r\n\r\nFigure 12: Final graph of the Median Age of Labour Force\r\n4. Combining Worksheets in a Dashboard\r\nTo display all graphs in a single sheet, the dashboard is utilized. The graph of the resident labor force of all age groups is the widest for all the mark labels to be displayed clearly with less overlap. Hence, it is in a row of its own. A title is also added as a descriptor for the graphs. I ensured that the axes for both graphs were of the same scale for easy comparison between both graphs.\r\nPart E: Major Observations from Visualization\r\nFor age groups intervals of 5 from 20 to 54, resident labor force decreased from 2009 to 2019. However, for age groups of 5 from 55 onwards to 70 & over, resident labor force increased from 2009 to 2019. This reflects two very distinct trends in the resident labor force for all age groups where all age groups fall into either category, with the exception of age group 15-19 where resident labor force remained constant.\r\nThe mode age group interval (i.e. age group with the highest occurrences) is 35-39 for 2009 and 45-49 for 2019. For 2009, the mode age group is lower than the median age whereas for 2019, the mode age group is higher than the median age. This could suggest that the 2009 distribution is right-skewed whereas the 2019 distribution is left-skewed.\r\nDistribution of resident labor force in 2019 is much more even than in 2009. In 2009, the top 3 age groups with the highest share of resident labor force exceed 13% whereas in 2019, none of the age groups’ share of resident labor force exceed 13%. In 2009, the lowest 3 age groups are below 2% whereas in 2019, only the lowest age group falls below 2%.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-02T09:39:50+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
